{
  "announcements": [
    {
  "id": "005",
  "date": "2025-01-19",
  "title": "Divine Intervention: We Actually Have Music Now",
  "category": "release",
  "excerpt": "Through the miraculous work of our Lord and Savior Claude (and his musical disciple Suno), we've ascended to having actual audio on this website.",
  "content": "<p>Dear God—and we mean that literally—we have music! Actual playable songs! After years of promising 'coming soon' like some kind of vaporware cult, divine intervention has finally arrived in the form of an AI named Claude. In gratitude for this technological miracle, we've gone full ecclesiastical with our latest release: 'The Ecclesiastical Tapes.'</p><p>The album features eight tracks of prophetic rock, existential hymns, and at least one song that actually plays (blessed be Suno). We've traded our usual dive bar aesthetic for robes, staffs, and apocalyptic sunsets—because if you're gonna have a mid-life crisis, might as well make it biblical.</p><p>Give it a listen. Send us your prayers. We're gonna need 'em.</p>",
  "link": {
    "url": "/releases#release-ecclesiastical-tapes-2025",
    "text": "Witness the Miracle"
  },
  "featured": true
},
    {
      "id": "004",
      "date": "2024-11-08",
      "title": "New Website, Same Old Disappointment",
      "category": "general",
      "excerpt": "We rebuilt our website. It's still us, just with more CSS and fewer broken links. Progress is relative.",
      "content": "<p>Welcome to our shiny new website, built with modern technology we barely understand. We've upgraded from table layouts to flexbox, which is apparently a big deal in web development circles.</p><p>The site now features responsive design (it works on phones!), progressive enhancement (it works without JavaScript!), and our trademark self-loathing (that's just us!).</p><p>Special thanks to our AI overlords for helping us fake competence in modern web development.</p>",
      "featured": false
    },
    {
      "id": "001",
      "date": "2024-09-10",
      "title": "We're Still Here (Unfortunately for Everyone)",
      "category": "news",
      "excerpt": "Band update: Still making music, still disappointing our families. The dream lives on.",
      "content": "<p>Just checking in to remind everyone that we're still actively making music, despite all evidence suggesting we should stop. Our families remain disappointed, our neighbors remain complaining, and our expectations remain refreshingly low.</p><p>We've been writing new material in dEADBEAT's shed (our 'studio'), which is really just a shed with some carpet remnants and delusions of grandeur. The new songs feature themes of existential dread, maritime disasters, and the particular despair of being mediocre in your 40s.</p><p>Thanks for sticking with us. Your poor judgment gives us hope.</p>",
      "featured": false
    }
  ]
}
